Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: རྫུ་འཕྲུལ་ དམ་པ་ ཐོབ་པ་ དེ་ལྟ་ བུ་ དེ་དག་ གིས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ འི་ ཆོས་གོས་ ནམ་མཁའ་ ལ་ འདུག་ [40a] པ འི་ གྲྭ་ གཅིག་ ཀྱང་ བསྒུལ་བ ར་ མི་ ནུས་ སོ །_།
en: even those who have attained such perfect supernatural powers will not be able [40.a] to move even a fold in the Thus-Gone One’s Dharma robe as he resides in the midst of space.

source: མཽད་གལ་ གྱི་ བུ་ ཁྱོད་ དང་ འདྲ་བ་ དེ་སྙེད་ འདུས་པ་ ལྟ་ཞོག་ གི _།
en: $213 “Maudgalyāyana, let us leave aside such a gathering of beings like you.

source: མཽད་གལ་ གྱི་ བུ་ གལ་ཏེ་ འདིར་ སེམས་ཅན་ ལ་ལ་ ཞིག་ སྐྱེས་པ ར་ གྱུར་ ཅིང་ །_ འདི་ལྟ་སྟེ །_ |#| གང་སྟོང་ གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་བཞིན་ གཤེགས་པ ས་ བྱིན་ གྱིས་ མ་ བརླབས་པ་ ཁ འི་ རླུང་ གཅིག་ གིས་ རྣམ་པར་ འཐོར་བ ར་ བྱེད །_ |#| རྡུལ་ དུ་ རློག་པ ར་ བྱེད །_ |#| རྣམ་པར་ འཇོམས་པ ར་ བྱེད་པ འི་ རྫུ་འཕྲུལ་ དེ་ལྟ་ བུ་ དང་ ལྡན་པ ར་ གྱུར་ ལ །_
en: Imagine instead, Maudgalyāyana, that a being has been born who possesses supernatural powers sufficient for conjuring up a storm that can scatter, pulverize, and destroy any trichiliocosm that has not been blessed by a thus-gone one.

source: སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ལས་ བྱུང་ བ འི་ རྡུལ་ དེས་ ཀྱང་ འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ ཀུན་ ཏུ་ ནོག་ ནོག་པོ ར་ གྱུར་ ཅིང་ །_ འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ ལས་ བྱུང་བ འི་ རྡུལ་ དེ་དེ ས་ ཕྱིར་ཡང་ བརྟུལ་ ནས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ སུ་ སོ་སོ ར་ བཞག་པ ར་ གྱུར་ ན
en: Imagine then that with each of the particles that thus emerge from one trichiliocosm he further plunges universes into darkness and destroys as many of them as there are grains of sand in the river Ganges, and that the particles emerging thereby are scattered throughout trichiliocosms.

source: མཽད་གལ་ གྱི་ བུ་ འདི་ སྙམ་ དུ་ སེམས །_
en: Maudgalyāyana, what do you think?

source: འོ་ན་ སེམས་ཅན་ དེ་ རྫུ་འཕྲུལ་ གྱི་ ཕ་རོལ་ དུ་ ཕྱིན་པ་ ཐོབ་པ་ ཡིན་ ནམ །_
en: Would such a being have perfected supernatural power?”

source: མཽད་གལ་ གྱི་ བུ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་ རྟེན་ གྱི་ ཁམས་ འདི །_ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ བུ་རམ་ཤིང་ གི་ ཚལ་ ལམ །_ འདམ་བུ འི་ ཚལ་ ལམ །_ སྐམ་ས འི་ འདམ་བུ འི་ ཚལ་ ལམ །_ འབྲས་ ཀྱི་ ཞིང་ ངམ །_ ཏིལ་ གྱི་ ཞིང་ བཞིན་ དུ་ སེམས་ཅན་ དེ་ལྟ་ བུ་ དག་ གིས་ གང་བ ར་ གྱུར་ ཀྱང་ མཽད་གལ་ གྱི་ བུ་ སེམས་ཅན་ རྫུ་འཕྲུལ་ དམ་པ འི་ ཕ་རོལ་ ཏུ་ སོན་པ་ དེ་ལྟ་ བུ་ དེ་དག་ གིས་ ཀྱང་ དེ་བཞིན་ གཤེགས་པ འི་ ཆོས་གོས་ ཀྱི་ གྲྭ་ ཙམ་ ཡང་ བསྒུལ་བ ར་ མི་ ནུས་ ན་
en: $214 “Maudgalyāyana,” |#| “even if this trichiliocosm were full of such beings with perfect supernatural powers—as many as there are plants on a field of sugar cane, reeds, grass, paddy, or sesame—they would still not be able to move even a fold in the Thus-Gone One’s Dharma robe.

source: དེ་བཞིན་ གཤེགས་པ་ མངོན་པར་ གདེགས་ པར་ བྱ་བ་ ལྟ་ཅི་ སྨོས་ ཏེ་ |#| དེ་ ནི་ གནས་ མེད་ དོ །_།
en: Needless it is to mention, then, that it would be impossible for them to lift up the Thus-Gone One.

source: མཽད་གལ་ གྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ་ གནས་ དེ་ཉིད་ དུ་ གནས་ ཤིང་ སེང་གེ འི་ གདན་ དེ་ཉིད་ ལ་ བཞུགས་ ནས །_ |#| ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ ཀྱི་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་ དཔག་ ཏུ་ མེད་པ་ གཡོ་ བར་ མཛད །_ |#| ཀུན་ དུ་ གཡོ་ བར་ མཛད །_ |#| ཀུན་ དུ་ རབ་ཏུ་གཡོ་ བར་ མཛད་ ཀྱང་
en: $215 “Maudgalyāyana, while remaining at this very place, upon this very lion throne, the Thus-Gone One may stir, move, and shake as many innumerable and unfathomable universes in the east as there are grains of sand in the river Ganges. [40.b]

source: སེམས་ཅན་ [40b] དེ་དག་ འདི་ སྙམ་ དུ་ བདག་ཅག་ འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ དུ་ ཁྲིད་ དོ །_། |#| ཀུན་ དུ་ ཁྲིད་ དོ་ སྙམ་ འམ །_
en: Yet the sentient beings there will not think, ‘Our universe is being dislocated and transported!’

source: ཀྱེ་མ་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ འཇིག་ གོ་ འཆགས་ སོ་ སྙམ་ དུ་ མི་ སེམས་ སོ །_།
en: Neither will they think, ‘Alas, this universe is subject to destruction and formation!’

source: དེ་དག་ འདི་ སྙམ་ དུ་ ཀྱེ་ མོ་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ འཐོར་ རོ །_། |#| རྣམ་པར་ འཇིག་ གོ་ སྙམ་ དུ་ མི་ སེམས་ ཏེ །_
en: Nor will they think, ‘This universe is being scattered and destroyed!’

source: སེམས་ཅན་ དེ་དག་ ལ་ འདུལ་བ འི་ དབང་ གིས་ ཁ་ཅིག་ ལ་ ནི་ སངས་རྒྱས་ ཀྱི་ གཟུགས་ ཀྱིས་ མཚན་མ་ མེད་པ འི་ ཚུལ་ དག་ གིས་ ཆོས་སྟོན་ ཏེ །_
en: However, for the sake of taming sentient beings, sometimes forms of the buddhas will teach beings the Dharma beyond marks,

source: ཉན་ཐོས་ དང་ །_ ལྷ་ དང་ །_ མི་ དང་ །_ ཀླུ་ དང་ །_ ཁྱེའུ་ དང་ །_ བུ་མོ འི་ གཟུགས་ ཀྱིས་ ཀྱང་ དེ་བཞིན་ ནོ །_།
en: but other times forms of hearers, gods, humans, nāgas, boys, or girls will deliver the teaching.

source: མཽད་གལ་ གྱི་ བུ་ སངས་རྒྱས་ ཀྱི་ སྟོབས་ དང་ །_ མི་ འཇིགས་པ་ དང་ །_ མ་ འདྲེས་པ་ དང་ །_ རྫུ་འཕྲུལ་ ཁྱུ་མཆོག་ དུ་ གྱུར་པ་ ཇི་སྙེད་པ་ དེ་སྙེད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ དག་ ལ་ ཁྱོད་ ཡིད་ཆེས་ པར་ གྱིས་ ཤིག _།
en: $216 “Maudgalyāyana, you must trust in all the different Dharma teachings on the buddhas’ powers, fearlessnesses, unique qualities, and preeminent miracles.

source: ཕྱོགས་ བཅུ་ ཐམས་ཅད་ དུ་ ཡང་ དེ་བཞིན་ ནོ །_།
en: This is how it is throughout all the ten directions.

source: མཽད་གལ་ གྱི་ བུ་ ངས་ དགེ་སློང་ ཀུན་དགའ་བོ་ ལ་ འདི་ལྟ་སྟེ །_ |#| མདོ འི་ སྡེ་ དང་ །_ དབྱངས་ ཀྱིས་ བསྙད་པ འི་ སྡེ་ དང་ །_ ལུང་ དུ་ བསྟན་པ འི་ སྡེ་ དང་ །_ དེ་ ལྟ་ བུ་ བྱུང་བ འི་ སྡེ་ དང་ །_ སྐྱེས་པ་ རབས་ ཀྱི་ སྡེ་ དང་ །_ ཤིན་ཏུ་ རྒྱས་པ འི་ སྡེ་ དང་ །_ རྨད་ དུ་ བྱུང་བ འི་ ཆོས་ ཀྱི་ སྡེ་ དང་ །_ རྟོགས་པ་ བརྗོད་པ འི་ སྡེ་ དང་ །_ གཏན་ ལ་ ཕབ་པ ར་ བསྟན་པ འི་ སྡེ འི་ གཟུངས་ ཀྱི་ སྒོ་ དག་ བསྟན་ ཀྱང་ །_
en: $217 “Maudgalyāyana, to the monk Ānanda I have taught the gateways for the retention of the sūtras, songs, prophecies, parables, past-life stories, elaborate teachings, marvels, narratives, and established teachings. |#| However,

source: མཽད་གལ་ གྱི་ བུ་ དགེ་སློང་ ཀུན་དགའ་ བོས་ ནི་ དེ་ བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ ཀུན་ཤེས་ པར་ མི་ ནུས་ སོ །_།
en: Maudgalyāyana, the monk Ānanda is incapable of understanding the domain of the Thus-Gone One.

source: མཽད་གལ་ གྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ འི་ ཡི་གེ་ གཅིག་ ཀྱང་ ཉན་ཐོས་ ཐམས་ཅད་ ཀྱིས་ བསྐལ་པ འམ །_ བསྐལ་པ་ བརྒྱ འམ །_ བསྐལ་པ་ སྟོང་ ངམ །_ བསྐལ་པ་ འབུམ་ དུའང་ ཀུན་ ཤེས་པ འམ །_ བསམ་པ འམ །_ ཀུན་ ཆུབ་པ ར་ མི་ ནུས་པ འི་ ཕྱིར་ ཏེ །_
en: Because, Maudgalyāyana, even if they try for an eon, a hundred eons, a thousand eons, or a hundred thousand eons, hearers will not be able to fully understand, conceive of, or comprehend even a single syllable of the Thus-Gone One.

source: དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ ལྟ་ཅི་ སྨོས །_
en: What then to say of their understanding of the Thus-Gone One’s full domain?

source: མཽད་གལ་ གྱི་ བུ་ དེ་ ལ་ དེ་བཞིན་ གཤེགས་པ་ དམིགས་པ་ དང་ །_ སྤྱོད་པ་ དང་ །_ སྤྱོད་ལམ་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ སེམས་ཅན་ རྣམས་ ལ་ འདོམས་ [41a] པར་ མཛད་ ཅིང་ །_ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་སྟོན་ པར་ མཛད་ ཀྱང་ །_
en: $218 “Maudgalyāyana, the thus-gone ones instruct sentient beings by means of numerous referents, activities, and modes of conduct. [41.a] In this way, they teach the Dharma to sentient beings. |#| However,

source: མཽད་གལ་ གྱི་ བུ་ དེ་བཞིན་ གཤེགས་པ འི་ ཆོས་གོས་ གསོལ་བ་ ལས་ སེམས་ཅན་ ཇི་སྙེད་ ཀྱི་ དོན་ མཛད་པ་ དང་ །_ དེ་ལས་ ཆོས་ བསྟན་པ་ ཇི་ལྟ་བུ་ འབྱུང་བ་ ཡང་ ཉན་ཐོས་ ཐམས་ཅད་ ཀྱིས་ ཀུན་ཤེས་ པར་ མི་ ནུས་ ཏེ
en: Maudgalyāyana, although wearing the Thus-Gone One’s Dharma robe accomplishes the aims of all beings and spawns the teaching of the Dharma, none of the hearers fully comprehend this.

source: མཽད་གལ་ གྱི་ བུ་ དེ་ ལ་ ཡང་ ཁྱོད་ སྤོབས་པ ར་ མི་ འགྱུར་ ན་ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ རབ་ཏུ་ ཤེས་པ་ ལྟ་ཅི་ སྨོས་ ཏེ་ དེ་ ནི་ གནས་ མེད་ དོ །_།
en: Maudgalyāyana, if you cannot even accommodate this teaching, then how could you possibly grasp the domain of the Thus-Gone One? |#| That is clearly impossible.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ འི་ ཚེ་ པད་མ་ ཆེན་པོ་ དེ་ བཞེས་ ནས །_ |#| བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་ དཔའ་ ཆེན་པོ་ བཟང་སྐྱོང་ ལ་སོགས་པ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཆོས་ ཀྱི་ གྲོང་ཁྱེར་ ཡོངས་སུ་ སྐྱོང་བ ར་ བྱེད་པ་ དེ་དག་ ལ་ བཀའ་ སྩལ་པ །_
en: $219 Having thus accepted the great lotus flower, the Blessed One next posed questions to Bhadrapāla and all the other bodhisattva great beings, who were guardians of the city of Dharma:

source: རིགས་ ཀྱི་ བུ་ དག་ ཁྱེད་ ཀྱིས་ དེ་བཞིན་ གཤེགས་པ འི་ ཆོས་ ཀྱི་ གཏེར་ དེ་ བསྲུང་བ འམ །_ སྦ་བ འམ །_ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ ཀུན་ཤེས་པ འམ །_ བརྗོད་པ འམ །_ བསྟན་པ འམ །_ ཡང་དག་ པར་ རབ་ཏུ་ བསྟན་པ ར་ ནུས་ སམ །_
en: “Noble sons, can you protect the treasure of the Thus-Gone One’s Dharma? |#| Can you conceal it? |#| Can you comprehend the full domain of the Thus-Gone One? |#| Can you express it? |#| Can you teach it? |#| Can you teach it in full?”

source: དེ་དག་ གིས་ གསོལ་པ །_
en: they replied,

source: བཅོམ་ལྡན་འདས་ རྔོ་ ཐོགས་ ལགས་སོ །_།
en: “Blessed One,” |#| “yes, we can.”

source: རིགས་ ཀྱི་ བུ་ དག་ དེ |#| འི་ ཕྱིར་ ཁྱེད་ ཀྱིས་ ཆོས་ གང་དང་གང་ ཁོ་ན་ སྟོན་པ་ དེ་ ཐམས་ཅད་ དེ་བཞིན་ གཤེགས་པ འི་ གཏེར་ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ ལ་ རྣམ་པར་ བལྟས་ ནས་ |#| བསྟན་པ ར་ བྱ འོ །_།
en: $220 “Noble sons,” |#| “you should therefore consider whichever Dharma teaching you give to be the treasure and domain of the thus-gone ones.

source: རིགས་ ཀྱི་ བུ་ དག་ གང་ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ ཡོངས་སུ་ རྫོགས་པ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ བྱང་ཆུབ་ ཡོངས་སུ་ རྫོགས་པ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཡེ་ཤེས་ གྲུབ་པ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ བྱང་ཆུབ་ གྲུབ་པ་ ཡང་དག་ པར་ བརྗོད་པ ས་ བརྗོད་པ་ དེས་ན་ རིགས་ ཀྱི་ བུ་ དག་ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ དེ་ཡང་ དག་པ ར་ བརྗོད་པ ས་ བརྗོད་པ ར་ བྱ འོ །_།
en: Noble sons, all that is expressed with respect to the buddhas’ perfect wisdom, the buddhas’ perfect awakening, the buddhas’ accomplishment of wisdom, and the buddhas’ accomplishment of awakening is the domain of the Thus-Gone One. |#| Thus it must be expressed.

source: རིགས་ ཀྱི་ བུ་ དག་ གང་ དུ་ དམིགས་ པ་ མཐོང་བ་ དེར་ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ ལ་ རྣམ་པར་ བལྟས་ ནས་ ངེས་པ ར་ བསྟན་པ ར་ བྱ འོ །_།
en: Noble sons, wherever an objective referent is seen, it is viewed as the Thus-Gone One’s domain and definitively taught to be so.

source: དེ་བཞིན་ གཤེགས་པ ས་ ཆོས་ བསྟན་པ་ དེ་ ནི་ གང་ དུ་ སེམས་ཅན་ གྱི་ སྤྱོད་པ་ མཐོང་བ་ དེར་ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ ལ་ རྣམ་པར་ བལྟས་ ནས་
en: That Dharma teaching by the Thus-Gone One is delivered by viewing the activities of sentient beings, wherever they are seen, as the Thus-Gone One’s domain. [41.b]

source: སེམས་ཅན་ དེ་ [41b] དག་ གི་ སྤྱོད་པ་ དེ་བཞིན་ གཤེགས་པ ས་ ཆོས་ བསྟན་པ འི་ སྤྱོད་པ ས་ དེ་དག་ རྣམ་པར་ བཟློག་ པར་ བྱ་བ འི་ ཕྱིར་ བསྟན་པ་ མ་ ཡིན་ ནོ །_།
en: Thus, the activities of the Thus-Gone One’s teaching of the Dharma are not displayed for the sake of stopping the activities of sentient beings.#19

source: གང་དག་ དེ་བཞིན་ གཤེགས་པ ས་ མཁྱེན་པ འི་ དབང་པོ་ སྟོང་ཕྲག་ དགུ་ བཅུ་ རྩ་ དགུ་ ནི་ འདོད་ཆགས་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ དེ་དག་ དང་ །_ ཞེ་སྡང་ སྤྱོད་པ་ རྣམས་ དང་ །_ གཏི་མུག་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ དེ་དག་ དང་ །_ འདོད་ཆགས་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་མུག་ བཅོས་མ་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ དེ་དག་ དང་ །_ འདོད་ཆགས་ དང་ །_ ཞེ་སྡང་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ དེ་དག་ དང་ །_ འདོད་ཆགས་ དང་ །_ ཞེ་སྡང་ བཅོས་མ་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ དེ་དག་ དང་ །_
en: $221 “The ninety-nine thousand faculties of the Thus-Gone One’s knowing are as follows:#20 the activities of those engaged in desire, or anger, or delusion; |#| the activities of those engaged in contrived desire, anger, or delusion; |#| the activities of those engaged in desire and anger; |#| the activities of those engaged in contrived desire and anger;

source: འདོད་ཆགས་ དང་ །_ གཏི་མུག་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ དེ་དག་ དང་ །_ འདོད་ཆགས་ དང་ །_ གཏི་མུག་ བཅོས་མ་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ དེ་དག་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་མུག་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་ པ་ དེ་དག་ དང་ །_ ཞེ་སྡང་ དང་ །_ གཏི་མུག་ བཅོས་མ་ སྤྱོད་པ་ རྣམས་ ཀྱི་ སྤྱོད་པ་ དེ་དག་ དང་ །_
en: the activities of desire and delusion; |#| the activities of those engaged in contrived desire and delusion; |#| the activities of those engaged in anger and delusion; |#| the activities of those engaged in contrived anger and delusion;

source: བསམ་པ་ ཡོངས་སུ་ སྦྱོང་བ ར་ བྱེད་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ དངོས་པོ་ སྒྲུབ་པ འི་ ཡོངས་སུ་ སྦྱོང་བ ར་ བྱེད་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ སྲིད་པ་ སྒྲུབ་པ་ ཡོངས་སུ་ སྦྱོང་བ ར་ བྱེད་ པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ སྦྱོར་བ་ ལས་ བྱུང་བ འི་ དབང་པོ་ དེ་དག་ དང་ །_
en: the faculties for purifying the mind; |#| the faculties for purifying the production of things; |#| the faculties for purifying the production of existence; |#| the faculties that emerge from application;

source: ལས་ བྱེད་པ་ སྒྲུབ་པ་ ཡོངས་སུ་ སྦྱོང་བ ར་ བྱེད་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ ནག་པོ འི་ ཆོས་ སློང་བ ར་ བྱེད་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ དཀར་པོ འི་ ཆོས་ ཀུན་ ནས་ སློང་བ ར་ བྱེད་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ གནག་ ཅིང་ དཀར་བ འི་ ཆོས་ སློང་བ ར་ བྱེད་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_
en: the faculties for purifying activities; |#| the faculties that activate black qualities; |#| the faculties that activate white qualities; |#| the faculties that activate black and white qualities;

source: ལམ་ གྱི་ རྗེས་སུ་ འཐུན་ པར་ བྱེད་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ ཞི་གནས་ ཀྱི་ རྗེས་སུ་ འཐུན་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ ལྷག་མཐོང་ གི་ རྗེས་སུ་ འཐུན་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_
en: the faculties that accord with the path; |#| the faculties that accord with tranquility ; |#| the faculties that accord with special insight;

source: ཟད་པ འི་ རྗེས་སུ་ འཐུན་པ འི་ དབང་ པོ་ དེ་དག་ དང་ །_ སྐྱེ་བ འི་ རྗེས་སུ་ འཐུན་ པར་ བྱེད་པ འི་ དབང་པོ་ དེ་དག་ དང་ །_ བདེན་པ འི་ རྗེས་སུ་ འཐུན་པ འི་ དབང་པོ་ དེ་དག་ གོ །_།
en: the faculties that accord with exhaustion; |#| the faculties that accord with birth; |#| and the faculties that accord with the truth.

source: མཽད་གལ་ གྱི་ བུ་ དེ་ ལ་ སྔོན་ གྱི་ སྤྱོད་པ འི་ ཚོགས་ དང་ ལྡན་པ འི་ དབང་པོ་ སྟོང་ཕྲག་ ཉི་ཤུ་ ནི་ གང་ གིས་ ཁ་དོག་ ནག་པོ འམ །_ དཀར་ ཤམ་ མམ །_ མདོག་ [42a] བཟང་པོ འམ །_ མདོག་ མི་ སྡུག་པ འམ །_ གྱོལ་པོ འམ །_ ལག་སོར་ རྡུམ་པོ འམ །_ ཞ་བོ འམ །_ འོན་པ འམ །_ ཞར་བ འམ །_ ལྕེ་མེད་པ་ སྒྲུབ་པ ར་ བྱེད་པ་ ནག་པོ འམ །_ གནག་ ཅིང་ དཀར་བ འི་ ལས་ ཀུན་ ནས་ སློང་བ ར་ བྱེད་པ་ དག་ གོ །_།
en: $222 Maudgalyāyana, in this regard, the twenty thousand faculties related to the accumulation of past conduct motivate actions that are either black, or black and white. [42.a] Such actions produce dark complexion, fair complexion, attractive complexion, unattractive complexion, crippled legs, missing hands or fingers, impaired movement, deafness, blindness, or a missing tongue.

source: སྔོན་ གྱི་ སྤྱོད་པ འི་ ཚོགས་ དང་ ལྡན་པ འི་ དབང་པོ་ སྟོང་ཕྲག་ ཉི་ཤུ་ ནི་ གང་ གིས་ དབྱིབས་ རིང་པོ འམ །_ ཐུང་ངུ འམ །_ སྐེམ་པོ འམ །_ སྦོམ་པོ འམ །_ བར་མ་ སྒྲུབ་པ ར་ བྱེད་པ འི་ ལས་ ཀུན་ ནས་ སློང་བ ར་ བྱེད་པ་ དག་ གོ །_།
en: The twenty thousand faculties related to the accumulation of past conduct also cause shapes that are long, short, thin, fat, or indistinct.

source: གང་དག་ མིག་ དང་ །_ རྣ་བ་ དང་ །_ སྣ་ དང་ །_ ལྕེ་ དང་ །_ ལུས་ དང་ །_ ཡིད་ ཀྱི་ དབང་པོ་ འགྱུར་བ་ རྣམས་ ཀྱི་ སྦྱོར་བ་ ལ་ གནས་ ཤིང་སྔོན་ གྱི་ ལས་ མངོན་པར་ སྒྲུབ་པ འི་ དབང་པོ་ སྟོང་ཕྲག་ ཉི་ཤུ་ ནི་ འདོད་ཆགས་པ འམ །_ ཞེ་སྡང་བ འམ །_ གཏི་མུག་པ འམ །_ འདོད་ཆགས་ དང་ བྲལ་བ འམ །_ ཞེ་སྡང་ དང་ བྲལ་བ འམ །_ གཏི་མུག་ དང་ བྲལ་བ་ ཡིན་ ནོ །_།
en: Engaging the faculties of the eyes, ears, nose, tongue, body, and mind, the twenty thousand faculties related to the accumulation of past conduct are those associated with desire, anger, delusion, absence of desire, absence of anger, or absence of delusion.

source: སྐྱེ་བ འི་ འབྲས་བུ་ མངོན་པར་ འགྲུབ་པ འི་ དབང་པོ་ སྟོང་ཕྲག་ སུམ་ཅུ་ ནི་ འཆི་བ འི་ དུས་ བྱེད་པ་ ཡིན་ ནོ །_།
en: The thirty thousand faculties that produce birth activate the time of death.

source: དེ་དག་ ནི་ འགྱུར་བ་ མངོན་པར་ གྲུབ་པ འམ །_ མཚན་མ་ མངོན་པར་ འགྲུབ་པ་ ན་ སྣང་བར་ གྱུར་ ཏེ །_
en: They become apparent when they create changes or signs,

source: ཡན་ལག་ རྣམས་ འགྲེ་ལྡོག་པ་ དང་ །_ དབང་ པོ་ འགྱུར་བ་ དང་ །_ ཡན་ལག་ གི་ ཚིགས་ དག་ འཆད་ ཅིང་ གནད་ དག་ འཇིག་པ་ ན་ མདོག་ མི་ སྡུག་པ་ ཉིད་ དུ་ སྣང་བ་ དེ་དག་ ནི་ མགུལ་ སྒྲ་ ངར་ངར་པོ ས་ འགགས་པ་ ཡིན་པ ར་ ཤེས་པ ར་ བྱ་ སྟེ
en: such as shaking of the limbs, changes in one’s faculties, bones breaking, or deterioration of the vital signs, which in turn causes loss of one’s luster. |#| These signs finally stop when the voice is choked.

source: དེ་ ནི་ སེམས་ཅན་ དམྱལ་བ འི་ སྐྱེ་གནས་ སམ །_ དུད་འགྲོ འི་ སྐྱེ་གནས་ སམ །_ གཤིན་རྗེ འི་ འཇིག་རྟེན་ དུ་ འདྲེན་པ ར་ བྱེད་ ཅིང་ །_
en: Such faculties lead to the realms of hell, animals, or starving spirits.

source: སངས་རྒྱས་ རྣམས་ མངོན་དུ་ བྱ་བ འི་ ཕྱིར་ མི་ རྣམས་ ཀྱི་ ནང་ དུའམ །_ ལྷ་ རྣམས་ ཀྱི་ ནང་ དུའམ །_ འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ དུ་ སྐྱེ་བ འམ །_ ཟག་པ་ ཟད་པ་ མངོན་དུ་ བྱེད་པ ར་ འདྲེན་པ ར་ བྱེད་པ འོ །_།
en: To attain buddhahood one is led to birth among humans, gods, or within different worlds. |#| Or one is led to actualize the exhaustion of defilements.

source: དེ་ ལ་ དབང་པོ་ སྟོང་ཕྲག་ བདུན་ཅུ་ རྩ་ བདུན་ ནི་ དགེ་བ འི་ རྩ་བ འི་ རྣམ་པ་ ལ་མོ ས་པ་ ལས་ བལྟ་བ ར་ བྱ འོ །_།
en: There are seventy-seven thousand faculties that should be considered if one is interested in the features of roots of virtue.

source: དབང་པོ་ སྟོང་ཕྲག་ ཉི་ཤུ་ ནི་ མི་དགེ་བ འི་ རྩ་བ འི་ རྣམ་པ་ ཡོངས་སུ་ འདྲེན་པ ར་ བྱེད་པ་ དག་ སྟེ །_ |#| འཆི་བ འི་ དུས་ བྱེད་པ འི་ ཡིན་པ ར་ ཤེས་པ ར་ བྱ འོ །_།
en: There are twenty thousand faculties that lead to roots of nonvirtue and these should be known to facilitate death.

source: དེ་བཞིན་ གཤེགས་པ འི་ གཏེར་ དེ་ [42b] ནི་ དེ་བཞིན་ གཤེགས་པ་ རྣམས་ ཀྱི་ སྤྱོད་ཡུལ་ ཡིན་ ཏེ །_
en: $223 The treasure of the thus-gone ones [42.b] is the domain of the thus-gone ones.

source: དེ་བཞིན་ གཤེགས་པ་ དག་ དེ་ ལ་ གནས་ ནས་ ཆོས་ རྣམ་པར་ འགྲེལ་པ ར་ མཛད་ ཅིང་ ཟད་པ ར་ ཡང་ མི་ འགྱུར་ ལ་ ངོམས་པ ར་ ཡང་དག་ པར་ རྗེས་སུ་ མ་ མཐོང་ ངོ་ །_།
en: Dwelling within that domain the Thus-Gone One explains the Dharma without ever tiring or running out of things to say.”

source: རྫུ་འཕྲུལ་ མངོན་པར་ འདུ་ མཛད་པ འི་ ཆེ་བ འི་ བདག་ཉིད་ ཀྱི་ བསྔགས་པ་ བརྗོད་པ འི་ ལེའུ་ ཞེས་ བྱ་ སྟེ་ གཉིས་པ འོ །།_།།
en: $224 This concludes the second chapter.

source: དེ འི་ ཚེ་ འཁོར་ དེ་ཉིད་ དུ་ བརྟན་པ འི་ བློ་གྲོས་ གཞོན་ནུ ར་ གྱུར་པ་ ཞེས་ བྱ་བ་ འདུས་པ ར་ གྱུར་ ཏེ་ འདུག་ གོ །_། |#| དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྟན་པ འི་ བློ་གྲོས་ གཞོན་ནུ ར་ གྱུར་པ་ སྟན་ ལས་ ལངས་ ཏེ་ བླ་གོས་ ཕྲག་པ་ གཅིག་ ཏུ་ གཟར་ ནས །_ |#| པུས་མོ་ གཡས་པ འི་ ལྷ་ང་ ས་ ལ་ བཙུགས་ ཏེ་
en: $225 Present in the gathering was a certain Dṛḍhamati­kumāra­bhūta, who now rose from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: ཐལ་མོ་ སྦྱར་བ་ བཏུད་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ གསོལ་པ །_
en: Joining his palms, he bowed toward the Blessed One and said,

source: བཅོམ་ལྡན་འདས་ ཆོས་ ཀྱི་ སྒོ་ འདི་དག་ ལས་ བདག་ གིས་ རྙེད་པ་ རྙེད་ ལགས་ ཏེ །_
en: “Blessed One, with this gateway of the Dharma I have discovered something very precious.

source: བཅོམ་ལྡན་འདས་ དེ འི་ སླད་ དུ་ ཅི་ཙམ་ དུ་ ཆོས་ དེ་ཉིད་ ཡོངས་སུ་ གྲུབ་པ ར་ བགྱི་བ འི་ དོན་ དུ་ ཆོས་ ཀྱི་ སྒོ་ འདི་ ལ་ སྤྱད་པ ར་ བགྱི འོ །_།
en: Blessed One, I shall henceforth practice this gateway of the Dharma in order to accomplish the Dharma.

source: བཅོམ་ལྡན་འདས་ བདག་ གིས་ དེང་ སླན་ཆད་ འདི་ལྟ་སྟེ །_ |#| ཆོས་ དེ་དག་ ཡོངས་སུ་ བཙལ་བ་ དང་ །_ ཡོངས་སུ་ གྲུབ་པ ར་ བགྱི་བ འི་ སླད་ དུ་ དེ་ལྟ་ བུ འི་ གོ་ཆ་ བགོས་པ འི་ སླད་ དུ་ སྟེ །_
en: From today on, Blessed One, I shall don a suitable armor to pursue and accomplish these Dharma teachings.

source: སླད་ ཀྱིས་ ཀྱང་ སླད་མ འི་ ཚེ་ སླད་མ འི་ དུས་ ན་ དེ་བཞིན་ གཤེགས་པ འི་ སྤྱོད་ཡུལ་ ཆོས་ ཀྱི་ གཏེར་ དེ་ ཐོས་ ཀྱི་ བར་ དུ་ བརྩོན་འགྲུས་ དོར་བ ར་ ཡང་ མི་ བགྱི འོ །_།
en: In the future, in times to come, I shall never let my diligence wane until I have listened to the Dharma treasure of the Thus-Gone One’s domain.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་ པོ་ བརྟན་པ འི་ བློ་གྲོས་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: replied the Thus-Gone One,

source: བརྟན་པ འི་ བློ་གྲོས་ ཁྱོད་ ང འི་ ཡེ་ཤེས་ ཆེན་པོ་ བསྐལ་པ་ བྱེ་བ་ གྲངས་མེད་ པས་ ཡང་དག་ པར་ བསྒྲུབ་པ་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་ ཞིང་ མངོན་པར་ བརྩོན་པ ར་ བྱེད་པ་ ནི་ ལེགས་ སོ་ ལེགས་ སོ །_།
en: $226 “Dṛḍhamati,” |#| “this is excellent. |#| It is excellent that throughout innumerable millions of eons you will continue to exert yourself in the pursuit of the practice of my great wisdom.

source: བརྟན་པ འི་ བློ་ གྲོས་ ཁྱོད་ ཡང་ ལེགས་ སོ །_།
en: Well done, Dṛḍhamati.

source: བརྟན་པ འི་ བློ་གྲོས་ ཡོངས་སུ་ བརྟག་པ་ བཟུང་ སྟེ །_ |#| གལ་ཏེ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ སེམས་ཅན་ གཟུགས་ཅན་ ནམ །_ གཟུགས་ཅན་ མ་ཡིན་པ འམ །_ འདུ་ཤེས་ ཅན་ ནམ །_ འདུ་ཤེས་ ཅན་ མ་ཡིན་པ འམ །_ [43a] འདུ་ཤེས་ ཅན་ ཡང་ མ་ ཡིན །_ |#| འདུ་ཤེས་ ཅན་ མ་ཡིན་པ་ ཡང་ མ་ཡིན་པ་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ཐམས་ཅད་ སྐད་ཅིག་ གཅིག་ དང་ །_ ཐང་ ཅིག་ དང་ །_ ཡུད་ཙམ་ ཅིག་ ལ་ མི འི་ ལུས་ ཐོབ་པ ར་ གྱུར་ ཏེ །_
en: Now, Dṛḍhamati, imagine that all at once, in one moment, in one instant, all beings in this trichiliocosm without exception—whether they are those with form, or those who are formless, and whether they are those with perception, or those without perception, [43.a] or those with neither perception nor non-perception—were to attain a human body.

source: དེ་ནས་ གང་ སེམས་ཅན་ དེ་དག་ ལ་ བདེ་བ འི་ ཡོ་བྱད་ ཐམས་ ཅད་ ཉེ་བ ར་ སྒྲུབ་པ ར་ བྱེད་པ འི་ མི་ལ་ ལ་ ཞིག་ བྱུང་བ ར་ གྱུར་ ལ །_
en: Then imagine that a man appears who provides all those beings with enjoyable things.

source: བསྐལ་པ འམ །_ བསྐལ་པ་ ལས་ ལྷག་པ ར་ འཛིན་པ ར་ བྱེད་ ཅིང་ །_ དེ འི་ ཚེ་ སེམས་ཅན་ དེ་དག་ གཟུགས་ རྣམས་ སམ །_ སྒྲ་ རྣམས་ སམ །_ དྲི་ རྣམས་ སམ །_ རོ་ རྣམས་ སམ །_ རེག་བྱ་ རྣམས་ ལ་ སེམས་སྐྱེས་ པར་ གྱུར་ ན་ |#| ཡང་ དེ་ནས་ མི་ དེས་ དེ་དག་ ཐམས་ཅད་ ཉེ་བ ར་ སྦྱིན་པ ར་ བྱེད་ ལ །_
en: He is able to lift them up and hold them by his hand for an eon or more, faithfully providing them with whatever forms, sounds, smells, tastes, and textures they might wish for.

source: སེམས་ཅན་ དེ་དག་ གི་ བཤང་བ འམ་ གཅི་བ་ ཡང་ ལག་པ་ ཅིག་ཤོས་ ཀྱིས་ བླངས་ ནས་ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ དུ་ འདོར་བ ར་ བྱེད་ དེ
en: Meanwhile, he uses his other hand to collect all the feces and urine of all those beings, depositing it all in a different universe.

source: སེམས་ཅན་ དེ་དག་ དྲི་ མི་ ཞིམ་པ ར་ གྱུར་ ན་ མི་ རུང་ ངོ་ སྙམ་ དུ་ སེམས་ ན །_
en: Because he does not want any of them to experience any unpleasant odor.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ཇི་སྙམ་ དུ་ སེམས །_
en: Dṛḍhamati, what do you think?

source: འོ་ན་ མི་ དེས་ སེམས་ཅན་ དེ་དག་ ལ་ བདེ་བ འི་ ཡོ་བྱད་ ཐམས་ཅད་ ཀྱིས་ རིམ་གྲོ་ བྱས་པ ར་ འགྱུར་ རམ་
en: Does that man render proper service to all those beings, providing them with desirable things?”

source: བཅོམ་ལྡན་འདས་ མི་ དེས་ བདེ་བ འི་ ཡོ་བྱད་ ཤིན་ཏུ་ མང་པོ ས་ རིམ་གྲོ་ བགྱི་བ་ ལགས་སོ །_།
en: $227 “Indeed, Blessed One,” |#| “he serves them with an extremely vast amount of enjoyable things.”

source: བརྟན་པ འི་ བློ་གྲོས་ མི་ དེས་ སེམས་ཅན་ དེ་དག་ ལ་ བདེ་བ འི་ ཡོ་བྱད་ ཐམས་ཅད་ ཀྱིས་ སོ་སོ ར་ རིམ་གྲོ་ བྱས་ ལ །_
en: $228 “Dṛḍhamati,” |#| “that man serves each of those beings, providing them with pleasant things.

source: རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ གང་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དོན་ དུ་ དེ་བཞིན་ གཤེགས་པ་ བཞུགས་ ཀྱང་ རུང་ །_ |#| ཡོངས་སུ་ མྱ་ངན་ ལས་ འདས་ ཀྱང་ རུང་ སྟེ །_ |#| བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་ ཅིང་ །_
en: $229 “Now think of a noble son or daughter who, regardless of whether the Thus-Gone One is present or has passed beyond suffering, develops the mind of unexcelled and perfect awakening for the sake of all beings.

source: བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཉན་པ་ ལ་ མོ ས་ པར་ འགྱུར་ ལ་
en: This person wishes to hear the teachings of the Bodhisattva Collection.
